{"pageProps":{"metadata":{"title":"Git et GitHub","pageTitle":"Git et GitHub","pageSubtitle":"CRA, ACEM Kénitra","authors":"Faouzi Mohamed","keywords":"Git, GitHub, student, etudiant","description":"Complète introduction sur git et github","date":"2021-02-13","lastUpdate":"2021-02-14","prev":"/home","next":"/formations/bureautique/powerpoint","path":"/formations/git-github","ogImg":"/images/formations/git-github-img.png","logo":"/images/formations/git-github-img.svg","logoAltTxt":"Icon of Git GitHub","formationDate":"2021-02-21","where":"cra-acem.tech/direct","doctype":"msdoc"},"navigation":{"prev":"/home","next":"/formations/bureautique/powerpoint"},"data":{"0":{"id":["section-1"],"metadata":{"title":"Git et GitHub","date":"2021-02-13","author":"Faouzi Mohamed"},"contentHTML":"<h2>Présentation</h2>\n<p>Dans cette formation nous allons <strong>présenter ce qu'est Git et GitHub</strong>. Nous allons expliquer leurs utilité, passer rapidement sur une initiation aux différentes termes à connaître ainsi que les diférentes façons de s'en servir. La formation sera faite par visio-conférence le <strong>Dimanche 21 Février 2021 (21/02/2021)</strong> présentée par <a href=\"https://github.com/faouziMohamed\" title=\"Lien vers le profile GitHub de Faouzi Mohamed\">@faouziMohamed</a>.</p>\n"},"1":{"id":["section-2"],"metadata":{"title":"Git et GitHub","date":"2021-02-14","author":"Faouzi Mohamed"},"contentHTML":"<h2>Introduction</h2>\n<p>Git et GitHub sont des outils informatiques qui sont devenus très populaire dernièrement sur les monde de développement informatiques. Git et GitHub ne sont pas la même chose et il ne sont pas créés par la même entité/entreprise. En effet, Git est <strong>système de contrôle de version</strong> open source\ncréé en 2005 par des développeurs travaillant sur le système d'exploitation Linux.\nGitHub, quand à lui, est une entreprise créée en 2008 qui, en gros, crée des outils qu'on s'en sert avec Git pour différentes tâches.</p>\n<p>Vous pouvez utiliser Git sans GitHub, cependant vous l'inverse n'est pas toujours le cas <em>(en générale on a toujours besoins de Git)</em>. Il existe d'autres alternatives (site web) à GitHub à savoir <em>GitLab</em>, <em>BitBucket</em>, et oui vous pouvez même créer votre propre <q>serveur git</q>. Ces derniers sont reconnues par Git sous le nom de <q lang=\"en\">Remote</q> (serveur distant).</p>\n<p>Vous n'avez pas besoins d'un remote pour utiliser git, cependant, les remotes facilites le partage de votre code avec <em><strong>les autres avec une très grande facilité</strong></em>.</p>\n"},"2":{"id":["section-3"],"metadata":{"title":"Git et GitHub","date":"2021-02-14","author":"Faouzi Mohamed"},"contentHTML":"<h2>Certains propos</h2>\n<p>Au premier abords, l'outil Git avait pour but de tracker les changements sur le code source d'un projet de développement informatique. Mais ces derniers temps avec l'évolution grandissante des technologies, Git s'intègre sur d'autres domaines.</p>\n<p>On peut citer par exemple :</p>\n<ul>\n<li>Utilisation avec l'administration des serveurs (Linux)</li>\n<li>Contrôle des changements sur des fichiers de configurations des logiciels et système appelés <q>Dotfiles</q></li>\n<li>etc,...</li>\n</ul>\n<p>La communauté de l'open source ne cessant de grandir, le partage de code sources des logiciels, applications Web et autres projets informatiques à pris une grande empleur.\nPour rendre facile ces opérations des solutions comme GitHub sont mise en place. Certains proposent des offres généreuses comme GitHub.</p>\n<p>GitHub possède un offre appelé <q lang=\"en\">GitHub student Developer</q> qui fait bénéficier aux étudiants des accès à des ressources qui ne sont pas toujours gratuit ou pas facile à y avoir accès.</p>\n"}}},"__N_SSG":true}