{"pageProps":{"metadata":{"title":"Git et GitHub","pageTitle":"Git et GitHub","pageSubtitle":"CRA, ACEM Kénitra","authors":"Faouzi Mohamed","keywords":"Git, GitHub, student, etudiant","description":"Complète introduction sur git et github","date":"2021-02-13","lastUpdate":"2021-02-14","path":"/formations/git-github"},"data":{"0":{"id":["section-1"],"metadata":{"title":"Git et GitHub","date":"2021-02-13","author":"Faouzi Mohamed"},"contentHTML":"<h2>Présentation</h2>\n<p>Dans cette formation nous allons <strong>présenter ce qu'est Git et GitHub</strong>. Nous allons expliquer leurs utilité, passer rapidement sur une initiation aux différentes termes à connaître ainsi que les diférentes façons de s'en servir. La formation sera faite par visio-conférence le <strong>Dimanche 21 Février 2021 (21/02/2021)</strong> présentée par <a href=\"https://github.com/faouziMohamed\" title=\"Lien vers le profile GitHub de Faouzi Mohamed\">@faouziMohamed</a>.</p>\n"},"1":{"id":["section-2"],"metadata":{"title":"Git et GitHub","date":"2021-02-14","author":"Faouzi Mohamed"},"contentHTML":"<h2>Introduction</h2>\n<p>Tout d'abord, Git et GitHub ne sont pas la même chose. En effet, Git est <strong>système de contrôle de version</strong> open source\ncréé en 2005 par des développeurs travaillant sur le système d'exploitation Linux.\nGitHub quand à lui, est une entreprise créée en 2008 qui, en gros, crée des outils qu'on s'en sert avec Git pour différentes tâches.</p>\n<p>Vous pouvez utiliser Git sans GitHub, cependant vous l'inverse n'est pas toujours le cas <em>(en générale on a toujours besoins de Git)</em>. Il existe d'autres alternatives (site web) à GitHub à savoir <em>GitLab</em>, <em>BitBucket</em>, et oui vous pouvez même créer votre propre <q>serveur git</q>. Ces derniers sont reconnues par Git sous le nom de <q lang=\"en\">Remote</q> (serveur distant).</p>\n<p>Vous n'avez pas besoins d'un remote pour utiliser git, cependant, les remotes facilites le partage de votre code avec <em><strong>les autres avec une très grande facilité</strong></em>.</p>\n"}},"navigation":{"prev":"/home","next":"/#"}},"__N_SSG":true}